#+Title: Planos de Aulas

* Apresentação  
  Estes planos de aulas tem um proposito especifico para aulas remotas nessa ocasiao de pandemia.
  Este material pressupoe o acompanhamento do professor.
* PAMI

  Nessa aula temos algumas orientacoes gerais e ambientacao no teams
  [[./pamI/Aula1.org][Aula1- Orientacoes Gerais]]
  
  Aqui a gente vai criar uma tela de login, lembrando como executa um
  aplicativo mobile do cordova no nosso navegador. 

  [[./pamI/tela_de_login_com_cordova.org][Aula - Tela de Login com Cordova]]
  
* PAMII
** asdfasdf
  [[./pamII/Aula1.org][Aula1]]

* PW3

  [[./pw3/Aula1.org][Aula1 - Orientacoes Gerais]]

  [[./pw3/Aula2.org][Aula2 - Amb e Primeiro Projeto Laravel]] 

  [[./pw3/laravel-e-heroku.org][Aula3 - Projeto Laravel no Heroku]]

  [[./pw3/laravel-e-heroku2.org][Aula4 - Entendendo o primeiro projeto Laravel]]
  
  [[./pw3/laravel-e-heroku3-PersistindoUsuario.org][Aula4 - Persistindo Usuarios]]


* Sites
  
  https://arcane-castle-14315.herokuapp.com/

  https://meuapplaravel.herokuapp.com/

  https://projetolaravel2.herokuapp.com/

  https://projetoum.herokuapp.com/

  https://my-f-project.herokuapp.com/


* BD3

  Nossas aulas estao nos links abaixo.


  [[./BD3/OrientacoesGerais.org][Aula1 - Orientacoes Gerais]]

  Essa Aula1 tem algumas orientacoes gerais apenas...

  As proximas aulas sao pra gente poder ter um banco pra
  trabalhar. 

  [[./BD3/Aula1-InstalacaoDoSqlserverComDocker.org][Aula1 - Inst Sqlserver Linux e Docker]]
  
  Nessa aula a gente instala o sqlserver no linux usando docker. 


  [[./BD3/UsandoBancoDoHeroku.org][Aula1 - Usando Bco Dados do Heroku]]

  Nessa aula a gente aprende a usar o banco de dados da nuvem do  heroku


  As proximas aulas servem pra gente criar nosso script sql pra gente
  ter um dominio pra gente trabalhar e aplicar os conceitos. 

  [[./BD3/Aula1-LojaInfo.org][Aula1 - LojaInfo (em html)]]
  
  [[./BD3/Aula1-LojaInfo.pdf][Aula1 - LojaInfo (em pdf)]]

  Nessa aula a gente revisa implementacao de banco de dados,
  integridade referencial e estabelece um dominio pra gente trabalhar
  depois com triggers, stored procedures etc...





https://devtalk.blender.org/t/blender-on-mobile-devices/14610/2

https://www.youtube.com/watch?v=U8RzsJfh3Gc

https://www.blendernation.com/2012/06/26/blenderplayer-for-android/



#+name: directories
#+begin_src shell :results replace
  echo asdfasdf
#+end_src


begin_src emacs-lisp name: blkname :var x=1 :session s1 :results replace :exports both :cache no :noweb no :tangle teste.el :shebang "#!/bin/bash"

#+NAME: uhuuhuhuhuh
#+begin_src emacs-lisp :tangle /path/to/your/file.el :mkdirp yes
(require 'org-tangle)
(message "asdfasdf")
#+end_src

#+RESULTS: uhuuhuhuhuh
: asdfasdf



#+NAME: jijijij
#+begin_src shell :var x=1 :session s1 :results output :exports both :tangle ./tanglefilename.sh :shebang "#!/bin/bash" :mkdirp yes :tangle-mode (identity #o755)
MINHAVARIAVEL=UHUHUH
echo $MINHAVARIAVEL
#+end_src

#+RESULTS: jijijij
: x='1'[?2004l
: [?2004hMINHAVARIAVEL=UHUHUH[?2004l
: [?2004hecho $MINHAVARIAVEL[?2004l
: UHUHUH








#+begin_src sh dir "/sudo::/home/administrador" :tangle "./erererer.sh" :mkdirp yes
echo asdfasdfasdfasdf
#+end_src

#+RESULTS:
: asdfasdfasdfasdf



#+begin_src shell :tangle yes :mkdirp yes
VARIAVEL=huhuhuh
echo $VARIAVEL
#+end_src

#+RESULTS:
: huhuhuh

